# -*- coding: utf-8 -*-
from input.util import *

########################################################################################################################################


#--------------------------------------------------------------------------------
# Cメジャー
# I, IIm, IIIm, IV,  V, VIm, VIImb5
# T,   S,    T,  S,  D,   T,      D
#--------------------------------------------------------------------------------


#--------------------------------------------------------------------------------
# 令和ボカロ進行
# key = C
# FM7,  E7,  Am7, C7
# IVM7, III, VIm, I7
#--------------------------------------------------------------------------------

#--------------------------------------------------------------------------------
# 〇コード進行のルール
# ・『Ｔ』は「Ｉ」「ＶＩm」のどちらでも使える。
# ・『Ｄ』は「Ｖ」のみ使える。
# ・『Ｓ』は「ＩＶ」「ＩＩm」のどちらでも使える。
# 
# ・「ＩＩm」は「Ｖ」にしか進めない。
# ・「ＩＶ」から「ＶＩm」へは進めない。
# ・ 元のコードから代理コードへは進めるが、代理コードから元のコードへは進めない。
# ・ 曲の最初と最後は「Ｉ」が望ましい。
#
# 要は・・・
# ・「Ｉ」は「ＩＩm」「ＩＶ」「Ｖ」「ＶＩm」の全てのコードに進める
# ・「ＩＩm」は「Ｖ」にしか進めない。
# ・「ＩＶ」は「Ｉ」か「ＩＩm」か「Ｖ」に進める。
# ・「Ｖ」は「Ｉ」か「ＶＩm」に進める。
# ・「ＶＩm」は「ＩＩm」か「ＩＶ」か「Ｖ」に進める。
# 
#--------------------------------------------------------------------------------



#--------------------------------------------------------------------------------
# 使い方
# ①曲のキーを決める ⇒ D_STRING_KEY
# ②コード進行とコードの長さを決める
#   → コード進行            ： D_LIST_CHORD_PREGRESSION
#   → コード長              ： D_LIST_CHORD_LEN
#   → 構成を決める          ： D_LIST_STRUCTURE
#   → ベースのリズムを決める： D_LIST_BASE_RYTHEM
# 
#--------------------------------------------------------------------------------



#--------------------------------------------------------------------------------
# Cメロ(サビ)
#--------------------------------------------------------------------------------

# キー定義
D_STRING_KEY             = "C"


# コード進行                 # 一小節目           # 二小節目        # 三小節目           # 四小節目          # 一小節目           # 二小節目        # 三小節目           # 四小節目       
D_LIST_CHORD_PREGRESSION = [ [ IVM7 , III7 ],     [ VIm7,  I7 ],    [ IVM7 , III7 ],     [ VIm7,  I7 ],      [ IVM7 , III7 ],     [ VIm7,  I7 ],    [ IVM7 , III7 ],     [ VIm7,  I7 ],    ]      # コード
D_LIST_CHORD_LEN         = [ [   L2 ,   L2 ],     [   L2,  L2 ],    [   L2 ,   L2 ],     [   L2,  L2 ],      [   L2 ,   L2 ],     [   L2,  L2 ],    [   L2 ,   L2 ],     [   L2,  L2 ],    ]      # コード長
#D_LIST_CHORD_PREGRESSION = [        [ IVM7 ],          [ III7 ],           [ VIm7 ],            [ I7 ],      [ IVM7 ],                 [ III7 ],           [ VIm7 ],              [ I7 ],  ]      # コード
#D_LIST_CHORD_LEN         = [        [   L1 ],          [   L1 ],           [   L1 ],            [ L1 ],      [   L1 ],                 [   L1 ],           [   L1 ],              [ L1 ],  ]      # コード長

D_LIST_STRUCTURE_MELODY  = [               0,                 0,                  0,                 0,             1,                        2,                  0,                 0,    ]      # メロディが同じ小節
D_LIST_STRUCTURE_RYTHEM  = [               0,                 0,                  1,                 2,             1,                        2,                  1,                 0,    ]      # リズムがが同じ小節
D_LIST_BASE_RYTHEM       = [              L2,                L2,                 L2,                L2,            L2,                       L2,                 L2,                L2,    ]      # ベースリズム


# Percussion リズム
D_INDEX_PRECUSSION_RYTHEM = 4#24

# Piano リズム
D_LIST_PIANO_RYTHEM = [ L6, L8, L8, L8, L16 ]

# Base リズム
D_INDEX_BASE_RYTHEM = 28#0



##--------------------------------------------------------------------------------
## Eメロ(A)
##--------------------------------------------------------------------------------
#
## キー定義
#D_STRING_KEY             = "C"
#
#
## コード進行                 # 一小節目           # 二小節目        # 三小節目           # 四小節目          # 一小節目           # 二小節目        # 三小節目           # 四小節目       
##D_LIST_CHORD_PREGRESSION = [ [ IVM7 , III7 ],     [ VIm7,  I7 ],    [ IVM7 , III7 ],     [ VIm7,  I7 ],      [ IVM7 , III7 ],     [ VIm7,  I7 ],    [ IVM7 , III7 ],     [ VIm7,  I7 ],    ]      # コード
##D_LIST_CHORD_LEN         = [ [   L2 ,   L2 ],     [   L2,  L2 ],    [   L2 ,   L2 ],     [   L2,  L2 ],      [   L2 ,   L2 ],     [   L2,  L2 ],    [   L2 ,   L2 ],     [   L2,  L2 ],    ]      # コード長
#D_LIST_CHORD_PREGRESSION = [        [ IVM7 ],          [ III7 ],           [ VIm7 ],            [ I7 ],      [ IVM7 ],                 [ III7 ],           [ VIm7 ],              [ I7 ],  ]      # コード
#D_LIST_CHORD_LEN         = [        [   L1 ],          [   L1 ],           [   L1 ],            [ L1 ],      [   L1 ],                 [   L1 ],           [   L1 ],              [ L1 ],  ]      # コード長
#
#D_LIST_STRUCTURE_MELODY  = [               0,                 0,                  0,                 0,             1,                        2,                  0,                 0,    ]      # メロディが同じ小節
#D_LIST_STRUCTURE_RYTHEM  = [               0,                 0,                  1,                 2,             1,                        2,                  1,                 0,    ]      # リズムがが同じ小節
#D_LIST_BASE_RYTHEM       = [              L2,                L2,                 L2,                L2,            L2,                       L2,                 L2,                L2,    ]      # ベースリズム
#
#
## Percussion リズム
#D_INDEX_PRECUSSION_RYTHEM = 24
#
## Piano リズム
#D_LIST_PIANO_RYTHEM = [ L2, L2, L3, L4, L8 ]
#
## Base リズム
#D_INDEX_BASE_RYTHEM = 28
#
#
#
##--------------------------------------------------------------------------------
## Fメロ(B)
##--------------------------------------------------------------------------------
#
## キー定義
#D_STRING_KEY             = "C"
#
#
## コード進行                 # 一小節目           # 二小節目        # 三小節目           # 四小節目          # 一小節目           # 二小節目        # 三小節目           # 四小節目       
##D_LIST_CHORD_PREGRESSION = [ [ IVM7 , III7 ],     [ VIm7,  I7 ],    [ IVM7 , III7 ],     [ VIm7,  I7 ],      [ IVM7 , III7 ],     [ VIm7,  I7 ],    [ IVM7 , III7 ],     [ VIm7,  I7 ],    ]      # コード
##D_LIST_CHORD_LEN         = [ [   L2 ,   L2 ],     [   L2,  L2 ],    [   L2 ,   L2 ],     [   L2,  L2 ],      [   L2 ,   L2 ],     [   L2,  L2 ],    [   L2 ,   L2 ],     [   L2,  L2 ],    ]      # コード長
#D_LIST_CHORD_PREGRESSION = [        [ IVM7 ],          [ III7 ],           [ VIm7 ],            [ I7 ],      [ IVM7 ],                 [ III7 ],           [ VIm7 ],              [ I7 ],  ]      # コード
#D_LIST_CHORD_LEN         = [        [   L1 ],          [   L1 ],           [   L1 ],            [ L1 ],      [   L1 ],                 [   L1 ],           [   L1 ],              [ L1 ],  ]      # コード長
#
#D_LIST_STRUCTURE_MELODY  = [               0,                 0,                  0,                 0,             1,                        2,                  0,                 0,    ]      # メロディが同じ小節
#D_LIST_STRUCTURE_RYTHEM  = [               0,                 0,                  1,                 2,             1,                        2,                  1,                 0,    ]      # リズムがが同じ小節
#D_LIST_BASE_RYTHEM       = [              L2,                L2,                 L2,                L2,            L2,                       L2,                 L2,                L2,    ]      # ベースリズム
#
#
## Percussion リズム
#D_INDEX_PRECUSSION_RYTHEM = 4
#
## Piano リズム
#D_LIST_PIANO_RYTHEM = [ L3, L4, L6, L8, L4, L6, L8,  L16 ]
#
## Base リズム
#D_INDEX_BASE_RYTHEM = 28
#
